In [1]:
##importing needed libraries
import pandas as pd

In [2]:
##importing dataset and checking first 5 rows
df = pd.read_csv('TSCstats.csv')
df.head(5)

,id,team,gender,birth_year,city,state,zip,location
0,21624,Williamson 2011 Girls Academy,F,2011,MURFREESBORO,TN,37129,Williamson
1,21628,Williamson 2011 Girls Academy,F,2011,Nashville,TN,37221,Williamson
2,21636,Williamson 2011 Girls Academy,F,2011,Thompsons S,TN,37179,Williamson
3,21643,Williamson 2011 Girls Academy,F,2011,Brentwood,TN,37027,Williamson
4,21653,Williamson 2011 Girls Academy,F,2011,Franklin,TN,37064,Williamson

In [4]:
##Total breakdown of gender for entire club
df['gender'].value_counts()

M    981
F    834
Name: gender, dtype: int64

In [5]:
##Gender (players) by location
df.groupby('location').gender.value_counts()

location      gender
Murfreesboro  M         104
              F          97
Nashville     M          72
              F          22
Sumner        F          89
              M          88
Williamson    M         717
              F         626
Name: gender, dtype: int64

In [6]:
#location by age
df.groupby('birth_year').location.value_counts()

birth_year  location
2004        Williamson       25
            Murfreesboro     10
            Sumner            5
2005        Williamson       65
            Murfreesboro     43
            Nashville        11
            Sumner           11
2006        Williamson      100
            Murfreesboro     39
            Nashville        32
            Sumner           23
2007        Williamson      134
            Sumner           37
            Murfreesboro     35
            Nashville        10
2008        Williamson      149
            Sumner           39
            Murfreesboro     15
            Nashville        15
2009        Williamson      142
            Sumner           18
            Murfreesboro     11
            Nashville         6
2010        Williamson      123
            Sumner           14
            Nashville        11
            Murfreesboro      6
2011        Williamson      174
            Murfreesboro      8
            Sumner            8
2012        Williamson      130
            Murfreesboro     18
            Sumner           12
2013        Williamson      111
            Murfreesboro     12
            Sumner            6
2014        Williamson       96
            Sumner            3
            Murfreesboro      2
2015        Williamson       59
            Nashville         7
            Murfreesboro      2
2016        Williamson       34
            Nashville         2
2019        Williamson        1
2020        Sumner            1
Name: location, dtype: int64

In [7]:
##Gender by birth year
df.groupby('birth_year').gender.value_counts()

birth_year  gender
2004        M          24
            F          16
2005        F          71
            M          59
2006        M          99
            F          95
2007        M         118
            F          98
2008        F         109
            M         109
2009        M          96
            F          81
2010        M          79
            F          75
2011        M          99
            F          91
2012        M          96
            F          64
2013        M          77
            F          52
2014        M          57
            F          44
2015        M          45
            F          23
2016        M          23
            F          13
2019        F           1
2020        F           1
Name: gender, dtype: int64